import telebot
from telebot import types
import random
import time

API_TOKEN = '293392235:AAEqvnM1OFso8ddProbcAjnDzjrx_w6DvP0'

techniques = {'6': {'УКЕМИ': ['МАЕ УКЕМИ', 'УШИРО УКЕМИ'],
                    'СИККО': ['МАЕ СИКО', 'УШИРО СИКО'],
                    'ТАИ САБАКИ': ['ОКУРИ-АСИ', 'АЮМИ-АСИ', 'ИРИМИ-ТЭНКАН', 'УСИРО-ТЭНКАН', 'КАЙТЭН'],
                    'ТАЧИ ВАЗА': ['АЙ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'АЙ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ УРА',
                                  'АЙ-ХАНМИ КАТАТЭ ДОРИ КОТЭ-ГАЕСИ НАГЭ ОМОТЭ',
                                  'АЙ-ХАНМИ КАТАТЭ ДОРИ КОТЭ-ГАЕСИ НАГЭ УРА',
                                  'АЙ-ХАНМИ КАТАТЭ ДОРИ ИККИО ОМОТЭ', 'АЙ-ХАНМИ КАТАТЭ ДОРИ ИККИО УРА',
                                  'АЙ-ХАНМИ КАТАТЭ ДОРИ ИРИМИ НАГЭ'],
                    'СУВАРИ ВАЗА': ['РИОТЭ ДОРИ КОКЬЮ-ХО']
                    },
              '5': {'ТАЧИ ВАЗА': ['ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИККИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИККИО УРА',
                                  'КАТА ДОРИ ИККИО ОМОТЭ', 'КАТА ДОРИ ИККИО УРА',
                                  'МОРОТЭ ДОРИ ИККИО ОМОТЭ', 'МОРОТЭ ДОРИ ИККИО УРА',
                                  'СЕМЭН УЧИ ИККИО ОМОТЭ', 'СЕМЭН УЧИ ИККИО УРА',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИРИМИ НАГЭ',
                                  'СЕМЭН УЧИ ИРИМИ НАГЭ',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ УРА',
                                  'СЕМЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                                  'ЧУДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                                  'РИОТЭ ДОРИ ТЭНЧИ НАГЭ',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УДЭ КИМЭ НАГЭ',
                                  'МОРОТЭ ДОРИ КОКЬЮ НАГЭ'],
                    'СУВАРИ ВАЗА': ['КАТА ДОРИ ИККИО ОМОТЭ', 'КАТА ДОРИ ИККИО УРА',
                                    'СЕМЭН УЧИ ИККИО ОМОТЭ', 'СЕМЭН УЧИ ИККИО ОМОТЭ УРА',
                                    'РИОТЭ ДОРИ КОКЬЮ-ХО']
                    },
              '4': {'ТАЧИ ВАЗА': ['СЕМЭН УЧИ САНКИО ОМОТЭ', 'СЕМЭН УЧИ САНКИО УРА',
                                  'СЕМЭН УЧИ УЧИ КАЙТЭН САНКИО',
                                  'ЙОКОМЭН УЧИ СИХО НАГЭ ОМОТЭ', 'ЙОКОМЭН УЧИ СИХО НАГЭ УРА',
                                  'ЙОКОМЭН УЧИ ИРИМИ НАГЭ',
                                  'ЙОКОМЭН УЧИ ТЭНЧИ НАГЭ',
                                  'ЙОКОМЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                                  'ЙОКОМЭН УЧИ УДЭ КИМЭ НАГЭ',
                                  'ЧУДАН ЦУКИ УДЭ КИМЭ НАГЭ',
                                  'ЧУДАН ЦУКИ ХИДЗИ КИМЭ ОСАЕ',
                                  'ДЗЕДАН ЦУКИ ИККИО ОМОТЭ', 'ДЗЕДАН ЦУКИ ИККИО УРА',
                                  'МОРОТЭ ДОРИ УДЭ КИМЭ НАГЭ'
                                  'РИОТЭ ДОРИ ИККИО ОМОТЭ', 'РИОТЭ ДОРИ ИККИО УРА',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ НИКИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ НИКИО УРА',
                                  'РИОТЭ ДОРИ КОТЭ-ГАЕСИ'],
                    'СУВАРИ ВАЗА': ['СЕМЭН УЧИ НИКИО ОМОТЭ', 'СЕМЭН УЧИ НИКИО УРА',
                                    'КАТА ДОРИ НИКИО ОМОТЭ', 'КАТА ДОРИ НИКИО УРА',
                                    'РИОТЭ ДОРИ КОКЬЮ-ХО']
                    },
              '3': {'ТАЧИ ВАЗА': ['СЕМЭН УЧИ ЙОНКИО ОМОТЭ', 'СЕМЭН УЧИ ЙОНКИО УРА',
                                  'СЕМЭН УЧИ ГОКИО',
                                  'ЙОКОМЭН УЧИ ИККИО ОМОТЭ', 'ЙОКОМЭН УЧИ ИККИО УРА',
                                  'ЙОКОМЭН УЧИ НИКИО ОМОТЭ', 'ЙОКОМЭН УЧИ НИКИО УРА',
                                  'ЙОКОМЭН УЧИ САНКИО ОМОТЭ', 'ЙОКОМЭН УЧИ САНКИО УРА',
                                  'ЧУДАН ЦУКИ СОТО КАЙТЭН НАГЭ',
                                  'ЧУДАН ЦУКИ УЧИ КАЙТЭН САНКИО',
                                  'ДЗЕДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                                  'ДЗЕДАН ЦУКИ СИХО НАГЭ ОМОТЭ', 'ДЗЕДАН ЦУКИ СИХО НАГЭ УРА',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УЧИ КАЙТЭН НАГЭ',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ЙОНКИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ЙОНКИО УРА',
                                  'МОРОТЭ ДОРИ ИККИО ОМОТЭ', 'МОРОТЭ ДОРИ ИККИО УРА',
                                  'МОРОТЭ ДОРИ КОТЭ-ГАЕСИ',
                                  'РИОТЭ ДОРИ ИРИМИ НАГЭ',
                                  'РИОТЭ ДОРИ КОКЬЮ НАГЭ'],
                    'УШИРО ВАЗА': ['РИОТЭ ДОРИ ИККИО ОМОТЭ', 'РИОТЭ ДОРИ ИККИО УРА',
                                   'РИОТЭ ДОРИ НИКИО ОМОТЭ', 'РИОТЭ ДОРИ НИКИО УРА',
                                   'РИОТЭ ДОРИ САНКИО ОМОТЭ', 'РИОТЭ ДОРИ САНКИО УРА',
                                   'РИОТЭ ДОРИ ХИДЗИ КАМЭ ОСАЕ',
                                   'РИОТЭ ДОРИ КОТЭ-ГАЕСИ НАГЭ',
                                   'РИОТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'РИОТЭ ДОРИ СИХО НАГЭ УРА',
                                   'РИОТЭ ДОРИ ИРИМИ НАГЭ',
                                   'РИОТЭ ДОРИ КОКЬЮ НАГЭ'],
                    'СУВАРИ ВАЗА': ['СЕМЭН УЧИ ИРИМИ НАГЭ', 'СЕМЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                                    'СЕМЭН УЧИ САНКИО ОМОТЭ', 'СЕМЭН УЧИ САНКИО УРА',
                                    'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ САНКИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ САНКИО УРА',
                                    'РИОТЭ ДОРИ КОКЬЮ-ХО'],
                    'ТАНТО ДОРИ': ['ЧУДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                                   'ЙОКОМЭН УЧИ СИХО НАГЭ',
                                   'СЕМЭН УЧИ ГОКИО']
                    },
              '2': {'ТАЧИ ВАЗА': ['СЕМЭН УЧИ ДЗЮ ВАЗА',
                                  'ЙОКОМЭН УЧИ ЙОНКИО ОМОТЭ', 'ЙОКОМЭН УЧИ ЙОНКИО УРА',
                                  'ЙОКОМЭН УЧИ ГОКИО',
                                  'ЙОКОМЭН УЧИ КОШИ НАГЭ',
                                  'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ КОШИ НАГЭ',
                                  'МУНЭ ДОРИ ИККИО ОМОТЭ', 'МУНЭ ДОРИ ИККИО УРА',
                                  'МУНЭ ДОРИ СИХО НАГЭ',
                                  'МУНЭ ДОРИ УЧИ КАЙТЭН САНКИО',
                                  'КАТА ДОРИ МЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                                  'КАТА ДОРИ МЭН УЧИ СИХО НАГЭ',
                                  'КАТА ДОРИ МЭН УЧИ ИРИМИ НАГЭ',
                                  'КАТА ДОРИ МЭН УЧИ КОШИ НАГЭ',
                                  'КАТА ДОРИ МЭН УЧИ ИККИО ОМОТЭ', 'КАТА ДОРИ МЭН УЧИ ИККИО УРА',
                                  'ДЗЕДАН ЦУКИ НИКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ НИКИО УРА',
                                  'ДЗЕДАН ЦУКИ САНКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ САНКИО УРА',
                                  'РИОКАТА ДОРИ КОКЬЮ НАГЭ',
                                  'МАЭ ГЕРИ ИРИМИ НАГЭ'],
                    'УШИРО ВАЗА': ['ЭРИ ДОРИ ИККИО',
                                   'РИОКАТА ДОРИ ИККИО',
                                   'РИОКАТА ДОРИ НИКИО',
                                   'РИОКАТА ДОРИ САНКИО',
                                   'РИОКАТА ДОРИ ИРИМИ НАГЭ',
                                   'РИОКАТА ДОРИ КОТЭ-ГАЕСИ НАГЭ',
                                   'РИОКАТА ДОРИ КОКЬЮ НАГЭ',
                                   'КАТАТЭ ДОРИ КУБИ СИМЭ ИККИО'],
                    'ХАНМИ-ХАНТАЧИ ВАЗА': ['ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ ОМОТЭ',
                                           'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ УРА',
                                           'МОРОТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'МОРОТЭ ДОРИ СИХО НАГЭ УРА'],
                    'СУВАРИ ВАЗА': ['СЕМЭН УЧИ ЙОНКИО ОМОТЭ', 'СЕМЭН УЧИ ЙОНКИО УРА',
                                    'СЕМЭН УЧИ СОТО КАЙТЭН НАГЭ',
                                    'ЧУДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                                    'ДЗЕДАН ЦУКИ ИККИО ОМОТЭ', 'ДЗЕДАН ЦУКИ ИККИО УРА',
                                    'РИОТЭ ДОРИ КОКЬЮ-ХО'],
                    'ТАНТО ТОРИ': ['ДЗЮ ВАЗА']
                    },
              '1': {'ТАЧИ ВАЗА': ['ЧУДАН ЦУКИ ДЗЮ ВАЗА',
                                  'ЙОКОМЭН УЧИ ДЗЮ ВАЗА',
                                  'МАЭ ГЕРИ ДЗЮ ВАЗА',
                                  'МУНЭ ДОРИ МЭН УЧИ ИККИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ ИККИО УРА',
                                  'МУНЭ ДОРИ МЭН УЧИ НИКИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ НИКИО УРА',
                                  'МУНЭ ДОРИ МЭН УЧИ САНКИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ САНКИО УРА',
                                  'МУНЭ ДОРИ МЭН УЧИ КОШИ НАГЭ',
                                  'ДЗЕДАН ЦУКИ ЙОНКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ ЙОНКИО УРА',
                                  'ДЗЕДАН ЦУКИ СИХО НАГЭ',
                                  'ДЗЕДАН ЦУКИ ИРИМИ НАГЭ',
                                  'ДЗЕДАН ЦУКИ СОТО КАЙТЭН НАГЭ',
                                  'ДЗЕДАН ЦУКИ КОШИ НАГЭ'],
                    'УШИРО ВАЗА': ['РИОТЭ ДОРИ ЙОНКИО ОМОТЭ', 'РИОТЭ ДОРИ ЙОНКИО УРА',
                                   'РИОТЭ ДОРИ ДЗЮ-ДЗИ НАГЭ',
                                   'КАТАТЭ ДОРИ КУБИ СИМЭ САНКИО',
                                   'КАТАТЭ ДОРИ КУБИ СИМЭ ХИДЗИ КИМЭ ОСАЕ',
                                   'ЭРИ ДОРИ ХИДЗИ КИМЭ ОСАЕ',
                                   'РИОКАТА ДОРИ ЙОНКИО ОМОТЭ', 'РИОКАТА ДОРИ ЙОНКИО УРА',
                                   'РИОХИДЗИ ДОРИ КОТЭ ГАЕСИ НАГЭ',
                                   'РИОХИДЗИ ДОРИ ИРИМИ НАГЭ'],
                    'ХАНМИ-ХАНТАЧИ ВАЗА': ['ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УЧИ КАЙТЭН НАГЭ ОМОТЭ',
                                           'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УЧИ КАЙТЭН НАГЭ УРА',
                                           'СЕМЭН УЧИ СОТО КАЙТЭН НАГЭ',
                                           'ДЗЕДАН ЦУКИ ИККИО',
                                           'ДЗЕДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ', ],
                    'СУВАРИ ВАЗА': ['РИОКАТА ДОРИ НИКИО',
                                    'РИОКАТА ДОРИ САНКИО',
                                    'РИОКАТА ДОРИ ЙОНКИО',
                                    'ЧУДАН ЦУКИ ИРИМИ НАГЭ',
                                    'ЙОКОМЭН УЧИ ИККИО',
                                    'ЙОКОМЭН УЧИ ГОКИО',
                                    'РИОТЭ ДОРИ КОКЬЮ-ХО', ],
                    'ТАНТО ТОРИ': ['ДЗЮ ВАЗА'],
                    'РАНДОРИ': ['2 УКЕ']
                    }
              }

kyu_tests = {'6': ['АЙ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'АЙ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ УРА',
                   'АЙ-ХАНМИ КАТАТЭ ДОРИ КОТЭ-ГАЕСИ НАГЭ ОМОТЭ', 'АЙ-ХАНМИ КАТАТЭ ДОРИ КОТЭ-ГАЕСИ НАГЭ УРА',
                   'АЙ-ХАНМИ КАТАТЭ ДОРИ ИККИО ОМОТЭ', 'АЙ-ХАНМИ КАТАТЭ ДОРИ ИККИО УРА',
                   'АЙ-ХАНМИ КАТАТЭ ДОРИ ИРИМИ НАГЭ'],
             '5': ['ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИККИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИККИО УРА',
                   'КАТА ДОРИ ИККИО ОМОТЭ', 'КАТА ДОРИ ИККИО УРА',
                   'МОРОТЭ ДОРИ ИККИО ОМОТЭ', 'МОРОТЭ ДОРИ ИККИО УРА',
                   'СЕМЭН УЧИ ИККИО ОМОТЭ', 'СЕМЭН УЧИ ИККИО УРА',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ИРИМИ НАГЭ',
                   'СЕМЭН УЧИ ИРИМИ НАГЭ',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ СИХО НАГЭ УРА',
                   'СЕМЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                   'ЧУДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                   'РИОТЭ ДОРИ ТЭНЧИ НАГЭ',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УДЭ КИМЭ НАГЭ',
                   'МОРОТЭ ДОРИ КОКЬЮ НАГЭ'],
             '4': ['СЕМЭН УЧИ САНКИО ОМОТЭ', 'СЕМЭН УЧИ САНКИО УРА',
                   'СЕМЭН УЧИ УЧИ КАЙТЭН САНКИО',
                   'ЙОКОМЭН УЧИ СИХО НАГЭ ОМОТЭ', 'ЙОКОМЭН УЧИ СИХО НАГЭ УРА',
                   'ЙОКОМЭН УЧИ ИРИМИ НАГЭ',
                   'ЙОКОМЭН УЧИ ТЭНЧИ НАГЭ',
                   'ЙОКОМЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                   'ЙОКОМЭН УЧИ УДЭ КИМЭ НАГЭ',
                   'ЧУДАН ЦУКИ УДЭ КИМЭ НАГЭ',
                   'ЧУДАН ЦУКИ ХИДЗИ КИМЭ ОСАЕ',
                   'ДЗЕДАН ЦУКИ ИККИО ОМОТЭ', 'ДЗЕДАН ЦУКИ ИККИО УРА',
                   'МОРОТЭ ДОРИ УДЭ КИМЭ НАГЭ'
                   'РИОТЭ ДОРИ ИККИО ОМОТЭ', 'РИОТЭ ДОРИ ИККИО УРА',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ НИКИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ НИКИО УРА'
                   'РИОТЭ ДОРИ КОТЭ-ГАЕСИ'],
             '3': ['СЕМЭН УЧИ ЙОНКИО ОМОТЭ', 'СЕМЭН УЧИ ЙОНКИО УРА',
                   'СЕМЭН УЧИ ГОКИО',
                   'ЙОКОМЭН УЧИ ИККИО ОМОТЭ', 'ЙОКОМЭН УЧИ ИККИО УРА',
                   'ЙОКОМЭН УЧИ НИКИО ОМОТЭ', 'ЙОКОМЭН УЧИ НИКИО УРА',
                   'ЙОКОМЭН УЧИ САНКИО ОМОТЭ', 'ЙОКОМЭН УЧИ САНКИО УРА',
                   'ЧУДАН ЦУКИ СОТО КАЙТЭН НАГЭ',
                   'ЧУДАН ЦУКИ УЧИ КАЙТЭН САНКИО',
                   'ДЗЕДАН ЦУКИ КОТЭ-ГАЕСИ НАГЭ',
                   'ДЗЕДАН ЦУКИ СИХО НАГЭ ОМОТЭ', 'ДЗЕДАН ЦУКИ СИХО НАГЭ УРА',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ УЧИ КАЙТЭН НАГЭ',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ЙОНКИО ОМОТЭ', 'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ ЙОНКИО УРА',
                   'МОРОТЭ ДОРИ ИККИО ОМОТЭ', 'МОРОТЭ ДОРИ ИККИО УРА',
                   'МОРОТЭ ДОРИ КОТЭ-ГАЕСИ',
                   'РИОТЭ ДОРИ ИРИМИ НАГЭ',
                   'РИОТЭ ДОРИ КОКЬЮ НАГЭ'],
             '2': ['СЕМЭН УЧИ ДЗЮ ВАЗА',
                   'ЙОКОМЭН УЧИ ЙОНКИО ОМОТЭ', 'ЙОКОМЭН УЧИ ЙОНКИО УРА',
                   'ЙОКОМЭН УЧИ ГОКИО',
                   'ЙОКОМЭН УЧИ КОШИ НАГЭ',
                   'ГЯКУ-ХАНМИ КАТАТЭ ДОРИ КОШИ НАГЭ',
                   'МУНЭ ДОРИ ИККИО ОМОТЭ', 'МУНЭ ДОРИ ИККИО УРА',
                   'МУНЭ ДОРИ СИХО НАГЭ',
                   'МУНЭ ДОРИ УЧИ КАЙТЭН САНКИО',
                   'КАТА ДОРИ МЭН УЧИ КОТЭ-ГАЕСИ НАГЭ',
                   'КАТА ДОРИ МЭН УЧИ СИХО НАГЭ',
                   'КАТА ДОРИ МЭН УЧИ ИРИМИ НАГЭ',
                   'КАТА ДОРИ МЭН УЧИ КОШИ НАГЭ',
                   'КАТА ДОРИ МЭН УЧИ ИККИО ОМОТЭ', 'КАТА ДОРИ МЭН УЧИ ИККИО УРА',
                   'ДЗЕДАН ЦУКИ НИКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ НИКИО УРА',
                   'ДЗЕДАН ЦУКИ САНКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ САНКИО УРА',
                   'РИОКАТА ДОРИ КОКЬЮ НАГЭ'
                   'МАЭ ГЕРИ ИРИМИ НАГЭ'],
             '1': ['ЧУДАН ЦУКИ ДЗЮ ВАЗА',
                   'ЙОКОМЭН УЧИ ДЗЮ ВАЗА',
                   'МАЭ ГЕРИ ДЗЮ ВАЗА',
                   'МУНЭ ДОРИ МЭН УЧИ ИККИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ ИККИО УРА',
                   'МУНЭ ДОРИ МЭН УЧИ НИКИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ НИКИО УРА',
                   'МУНЭ ДОРИ МЭН УЧИ САНКИО ОМОТЭ', 'МУНЭ ДОРИ МЭН УЧИ САНКИО УРА',
                   'МУНЭ ДОРИ МЭН УЧИ КОШИ НАГЭ',
                   'ДЗЕДАН ЦУКИ ЙОНКИО ОМОТЭ', 'ДЗЕДАН ЦУКИ ЙОНКИО УРА',
                   'ДЗЕДАН ЦУКИ СИХО НАГЭ',
                   'ДЗЕДАН ЦУКИ ИРИМИ НАГЭ',
                   'ДЗЕДАН ЦУКИ СОТО КАЙТЭН НАГЭ',
                   'ДЗЕДАН ЦУКИ КОШИ НАГЭ']}

kyu = None
timelapse = None

bot = telebot.TeleBot(API_TOKEN)

@bot.message_handler(commands=['help'])
def help_message(message):
    bot.send_message(message.chat.id, '/exam - выбор КЮ для подготовки к экзамену')

@bot.message_handler(commands=['exam'])
def kyu_choosing(message):
    markup = types.ReplyKeyboardMarkup(one_time_keyboard=True)
    markup.add('6-й кю. Белый пояс', '5-й кю. Желтый пояс', '4-й кю. Оранжевый пояс', '3-й кю. Зеленый пояс', '2-й кю. Красный пояс', '1-й кю. Коричневый пояс')
    msg = bot.reply_to(message, 'Выберите КЮ для подготовки к аттестации', reply_markup=markup)
    bot.register_next_step_handler(msg, timelapse_choosing)

def timelapse_choosing(message):
    global kyu
    kyu = message.text[0]
    markup = types.ReplyKeyboardMarkup(one_time_keyboard=True)
    markup.add('1', '5', '60')  # Имена кнопок
    msg = bot.reply_to(message, 'Выберите время (в секундах) для отработки техники', reply_markup=markup)
    bot.register_next_step_handler(msg, process_step)

def process_step(message):
    global kyu
    global timelapse
    timelapse = int(message.text)
    chat_id = message.chat.id
    markup = types.ReplyKeyboardHide(selective=False)
    bot.send_message(chat_id, 'Аттестационная программа на ' + kyu + ' кю', reply_markup=markup)
    for group in techniques[kyu].keys():
        bot.send_message(chat_id, '*' + group + '*',  parse_mode='Markdown')
        time.sleep(1)
        rez_line = techniques[kyu].get(group)
        random.shuffle(rez_line)
        for tech in rez_line:
            bot.send_message(chat_id, '.       ' + tech)
            time.sleep(timelapse)
    bot.send_message(chat_id, '*---=== FINISH ===---*', parse_mode='Markdown')
bot.polling()

'''
    rez_line = kyu_tests[kyu]
    random.shuffle(rez_line)
    for item in rez_line:
        bot.send_message(chat_id, item)
        time.sleep(timelapse)
'''


